import React from 'react';
import Navbar from "../global/Navbar";
import Footer from "../global/Footer";
import * as Style from "./recipe.module.css";

import Slide2 from "../../assets/samples/slide2.jpg";

export default function Recipe() {
    return(
        <div>
            <Navbar/>
            <div className="container pt-5">
                    <h2 className={Style["food-title"]}>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با ا </h2>
                    <img src={Slide2} className={"rounded  mt-4 " + Style["food-img"]}/>
                    <div className={"d-flex  mt-3 " + Style["food-likes"]}>
                        <hr className="flex-grow-1"/>
                        <a href="#" className={" pr-4 pl-5 " + Style["food-category"]}>
                            <span>فست فود</span>
                        </a>
                        <div className="px-4">
                            <span>12k</span>
                            <span data-uk-icon="icon: heart"></span>
                        </div>
                        <div className="px-4">
                            <span>متوسط</span>
                            <span data-uk-icon="icon: happy"></span>
                        </div>
                        <div className="pr-5 pl-4">
                            <span>3 نفر</span>
                            <span data-uk-icon="icon: users"></span>
                        </div>
                        <hr className="flex-grow-1"/>
                    </div>

                    <h3 className={Style["ingredients-title"] + " mt-5"}>مواد لازم:</h3>
                    <div className="table-responsive mt-3">
                        <table className={"table " + Style["ingredients-table"]}>

                            <tbody>
                            <tr>
                                <td>پیاز</td>
                                <td>1 عدد</td>
                            </tr>
                            <tr>
                                <td>سرکه</td>
                                <td>2 قاشق غداخوری</td>
                            </tr>
                            <tr>
                                <td>نمک و فلفل</td>
                                <td>به مقدار لازم</td>
                            </tr>
                            <tr>
                                <td>سرکه</td>
                                <td>2 قاشق غداخوری</td>
                            </tr>

                            </tbody>
                        </table>
                    </div>

                    <h3 className={Style["ingredients-title"] + " mt-5"}>طرز تهیه:</h3>
                    <p className={Style["instructions-para"]}>
                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
                        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
                        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری
                        را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
                        صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                        زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی
                        اساسا مورد استفاده قرار گیرد.

                        <br/>
                        <br/>

                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
                        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
                        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری
                        را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
                        صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                        زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی
                        اساسا مورد استفاده قرار گیرد.

                        <br/>
                        <br/>

                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
                        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی
                        مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری
                        را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
                        صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                        زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی
                        اساسا مورد استفاده قرار گیرد.
                    </p>
                </div>
            <Footer/>
        </div>
    )
}